In [1]:
#add 1 row 
import pandas as pd
mark={'name':['harish','rakshitha','manohara','vidya'],
      'maths':[87,98,87,95],
      'itskills':[83,99,4,76]
     }
df=pd.DataFrame(mark)
display(df)

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2   manohara     87         4
3      vidya     95        76

In [2]:
df.loc[len(df.index)]=['hardik',89,96]
df

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2   manohara     87         4
3      vidya     95        76
4     hardik     89        96

In [3]:
df.loc[2]=['hardik',89,96]
df

        name  maths  itskills
0     harish     87        83
1  rakshitha     98        99
2     hardik     89        96
3      vidya     95        76
4     hardik     89        96